//datapicker with jquery
   $('#date').datepicker({
       beforeShowDay: $.datepicker.noWeekends,
       format:'ДД/ММ/ГГГГ',
       minDate: new Date()
   });
   
   jQuery(function($) {
    $('input.datetimepicker').datepicker({
      duration: '',
      changeMonth: false,
      changeYear: false,
      yearRange: '2021:2030',
      showTime: false,
      time24h: true
    });
  
    $.datepicker.regional['ru'] = {
      closeText: 'Закрыть',
      prevText: "&#x3C;Пред",
      nextText: 'След&#x3E;',
      currentText: 'Сегодня',
      monthNames: ['Январь','Февраль','Март','Апрель','Май','Июнь',
      'Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь'],
      monthNamesShort:['Янв','Фев','Мар','Апр','Май','Июн',
      'Июл','Авг','Сен','Окт','Ноя','Дек'],
      dayNames: ['воскресенье','понедельник','вторник','среда','четверг','пятница','суббота'],
      dayNamesShort: ['вск','пнд','втр','срд','чтв','птн','сбт'],
      dayNamesMin: ['Вс','Пн','Вт','Ср','Чт','Пт','Сб'],
      weekHeader: 'Нед',
      dateFormat: 'dd/mm/yy',
      firstDay: 1,
      isRTL: false,
      showMonthAfterYear: false,
      yearSuffix: ''
    };
  
    $.datepicker.setDefaults($.datepicker.regional['ru']);
  });

  //limit text
   $(document).ready(function() {
    $('input[type="text"]').attr({ maxLength : 10 });
 });

  //limit phone number   
    $("#phoneNumber").keypress(function (e) {
       
       var maxlengthNumber = parseInt($('#phoneNumber').attr('maxlength'));
       var inputValueLength = $('#phoneNumber').val().length + 1;
       if (e.which != 11 && e.which != 0 && (e.which < 48 || e.which > 57)) {
          
                 return false;
      }
      if(maxlengthNumber < inputValueLength) {
          return false;
      }
     });
 

     //change language option
     var arrLang = {
        'kg': {
          '1': 'Кыргыз Республикасынын Тажикистан Республикасындагы Элчилиги',
          '2': 'Дайындоо',
          '3': 'Аты-жөнү:',
          '4': 'Фамилия:',
          '5': 'Паспорттун номери:',
          '6': 'Телефон номуру:',
          '7': 'Э-почта дареги: (милдеттүү эмес)',
          '8': 'Дайындоо күнү:',
          '9': 'Убакытты тандаңыз:',
          '10': ' Келүү максатын тандаңыз:',
          '11': 'Кыргыз Республикасынын эрезеге жеткен жарандары үчүн КР-нын жалпы жарандык паспортун каттоо',
          '12': '18 жашка чейинки балдар үчүн Кыргыз Республикасынын жалпы жарандык паспортун каттоо',
          '13': 'Туулгандыгы тууралуу күбөлүктү каттоо',
          '14': 'Кыргыз Республикасына кайтып келүү күбөлүгүн каттоо',
          '15': 'Документтерди легалдаштыруу',
          '16': 'Кыргыз Республикасынын визаларын иштеп чыгуу',
          '17': 'Нотариалдык иш-аракеттер жана башка кызматтар',
          '18': 'Маалымат',
          '19': 'Жөнөт',
          '20':'Консулдук болум',
          '21':'Адрес: Душанбе шаары,  Соид Носирова кочосу, 56 А',
          'nameHolder':'Аты-жөнү:'
          },
        'ru': {
          '1': 'Посольство Кыргызской Республики в Республике Таджикистан',
          '2': 'Запись на приём',
          '3': 'Имя:',
          '4': 'Фамилия:',
          '5': 'Номер паспорта:',
          '6': 'Номер телефона:',
          '7': 'Электронная почта:(необязательнo)',
          '8': 'Дата на приём:',
          '9': ' Выберите время:',
          '10': ' Выберите цель заявки:',
          '11': ' Оформление общегражданского паспорт КР для совершеннолетних граждан КР',
          '12': ' Оформление общегражданского паспорт КР для детей, не достигших 18-летнего возраста',
          '13': ' Оформление свидетельства о рождении',
          '14': ' Оформление Свидетельство на возвращение в Кыргызскую Республику',
          '15': ' Легализация документов',
          '16': ' Оформление визы Кыргызской Республики',
          '17': ' Нотариальные действия и другие услуги',
          '18': ' Инфо',
          '19': ' Отправить',
          '20': 'Консульский отдел',
          '21': 'Адрес: г. Душанбе, ул. Соид Носирова 56 А'
          
        }
    }
        $(function() {
          $('.dropdown-item').click(function() {
            var lang = $(this).attr('id');
      
            $('.lang').each(function() {
              $(this).text(arrLang[lang][$(this).attr('key')]);
              $(this).text(arrLang[lang][$(this).attr('placeholder')]);
            });
          });
        });
//1)placeholderin icindeki yazilari  ve validated kisimlari ceviremedim
//2)   
